app/controllers/chains_controller.rb

  def index
    @chains = Chain.paginate :page => params[:page]
---
SELECT * FROM "chains" LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "chains"

  def show
    @chain = Chain.find(params[:id])
---
SELECT * FROM "chains" WHERE ("chains"."id" = 1)

  def edit
    @chain = Chain.find(params[:id])
---
SELECT * FROM "chains" WHERE ("chains"."id" = 1)

  def create
    @chain = Chain.new(params[:chain])

    respond_to do |format|
      if @chain.save
---
INSERT INTO "chains" ("updated_at", "title", "description", "created_at") VALUES('2009-06-07 16:54:25', 'Nandos', 'Nandos Chicken!', '2009-06-07 16:54:25')

  def update
    @chain = Chain.find(params[:id])

    respond_to do |format|
      if @chain.update_attributes(params[:chain])
---
SELECT * FROM "chains" WHERE ("chains"."id" = 4)
UPDATE "chains" SET "description" = 'Primmi Piatto', "updated_at" = '2009-06-08 06:32:21' WHERE "id" = 4