app/controllers/stores_controller.rb

  def create
    debugger
    @store = has_chain? ? @parent.build(params[:store]) : @parent.new(params[:store])

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("latitude", "updated_at", "title", "description", "chain_id", "longitude", "created_at") VALUES(NULL, '2009-06-09 00:56:10', 'Sunninghill', 'Nandos in Sunninghill', NULL, NULL, '2009-06-09 00:56:10')

  def find_parent
    debugger
    @chain = Chain.find(params[:chain_id])
---
SELECT * FROM "chains" WHERE ("chains"."id" = 4)