app/controllers/stores_controller.rb

SELECT * FROM "stores"
---
  def index
    @stores = Store.all

SELECT * FROM "stores" WHERE ("stores"."id" = 1)
---
  def show
    @store = Store.find(params[:id])